app/controllers/guests_controller.rb

INSERT INTO "guests" ("created_at", "dish", "email", "facebook", "instagram", "lastname", "mobile", "name", "twitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @guest = Guest.new(guest_params)
    respond_to do |format|
      if @guest.save