app/controllers/images_controller.rb

  def images_status
    @images = params[:content]

    if @images
      @images.each do |key, image|
        @image = Image.find(image[:id])

        if image[:approved] == 'on'
          @image.update_attributes(approved: true)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "images" SET "approved" = ?, "updated_at" = ? WHERE "images"."id" = 1  [["approved", true], ["updated_at", Sun, 01 Sep 2013 18:18:39 UTC +00:00]]