app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by_username(params[:username])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = 'jccanizal' LIMIT 1