app/controllers/uploaders_controller.rb

SELECT "uploaders".* FROM "uploaders" WHERE "uploaders"."email" = 'jc.canizal@gmail.com' LIMIT 1
---
  def create
    @uploader = Uploader.find_or_initialize_by(email:uploader_params[:email])